// --створити масив з:
//     - з 5 числових значень
// let numberArray = [1,2,3,4,5]
// - з 5 стічкових значень
// for (const array of numberArray) {
//     console.log(array);
// }
// let stringArray = ['hello','my','friend','how`re','you?']
// - з 5 значень стрічкового, числового та булевого типу
// for (const array of stringArray) {
//     console.log(array);
// }
// let strNumBoolArray = [1,'more','time','tell the',true]
// - та вивести його в консоль
// for (const array of strNumBoolArray) {
//     console.log(array);
// }
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// let array = [];

// - є масив [2,17,13,6,22,31,45,66,100,-18] :
// 1. перебрати його циклом while
//     2. перебрати його циклом for
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// let arr = [true,2,'sdfgsdf',false,true,2,4,5,'sqfdas',true];
// for (const arrElement of arr) {
//     if(typeof arrElement === "boolean"){
//         console.log(arrElement);
//     }
//     if (typeof arrElement === "string"){
//         console.log(arrElement);
//     }
//     if (typeof arrElement === "number"){
//         console.log(arrElement);
//     }
// }
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
for (let i = 1; i < 101 ; i++) {
    i += 1;
    document.write(`<div>${i}</div>`)
    console.log(i);
}
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
for (let i = 1; i < 100 ; i++) {
    i += 2;
    document.write(`<div>${i}</div>`)
    console.log(i);
}


// стоврити масив книжок (назва, кількість сторінок, автори , жанри).
// -знайти наібльшу книжку.
// - знайти книжку/ки з найбільшою кількістю жанрів
// - знайти книжку/ки з найдовшою назвою
// - знайти книжку/ки які писали 2 автори
// - знайти книжку/ки які писав 1 автор

const books = [
    {title:'Рожеві падкрадулі',pages:345,author:'Олена Витрикуш',genre:['Комедія']},
    {title:'Модніца',pages:444,author:'Олена Витрикуш',genre:['Драма']},
    {title:'Воно',pages:374,author:'Кіт',genre:['Ужас']},
    {title:'Мілфа',pages:677,author:'Іван Жиганов',genre:['Роман']},
    {title:'Хто випустив собаку?',pages:543,author:'пес',genre:['Пригоди']},
    {title:'Голуба Лагуна',pages:1123,author:'Педро',genre:['Роман']},
    {title:'Екзорцист',pages:655,author:'Олена Витрикуш',genre:['Ужас','пригоди','фантастика']},
    {title:'Harry Potter',pages:454,author:'Педро',genre:['Пригоди','Детектив']},
    {title:'',pages:0,author:'',genre:''}
];
for (const book of books) {
    if( Math.max(book.pages)){
        console.log(book);
    }
}